qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_hal_esmc.h
/** @defgroup ESMC_InstructionMode ESMC Instruction Mode
* @{
*/
#define ESMC_INSTRUCTION_NONE          ((uint32_t)0x00U)    /*!<No instruction*/
#define ESMC_INSTRUCTION_SINGLE_LINE   ((uint32_t)0x01U)    /*!<Instruction on a single line*/
#define ESMC_INSTRUCTION_MULTI_LINES   ((uint32_t)0x02U)    /*!<Instruction on multi lines*/
/**
  * @}
  */

/** @defgroup ESMC_AddressMode ESMC Address Mode
* @{
*/
#define ESMC_ADDRESS_NONE              ((uint32_t)0x00U)    /*!<No address*/
#define ESMC_ADDRESS_SINGLE_LINE       ((uint32_t)0x01U)    /*!<Address on a single line*/
#define ESMC_ADDRESS_MULTI_LINES       ((uint32_t)0x02U)    /*!<Address on multi lines*/
/**
  * @}
  */

/** @defgroup ESMC_AddressSize ESMC Address Size
  * @{
  */
#define ESMC_ADDRESS_8_BITS            ((uint32_t)ESMC_CR3_ADDR8BIT)    /*!<8-bit address*/
#define ESMC_ADDRESS_16_BITS           ((uint32_t)ESMC_CR3_ADDR16BIT)   /*!<16-bit address*/
#define ESMC_ADDRESS_24_BITS           ((uint32_t)0x00)                 /*!<24-bit address*/
#define ESMC_ADDRESS_32_BITS           ((uint32_t)ESMC_CR3_ADDR32BIT)   /*!<32-bit address*/
/**
  * @}
  */

/** @defgroup ESMC_DataMode ESMC data mode
  * @{
  */
#define ESMC_DATA_NONE                 ((uint32_t)0x00U)   /*!<No data*/
#define ESMC_DATA_WRITE                ((uint32_t)0x01U)   /*!<data write mode*/
#define ESMC_DATA_READ                 ((uint32_t)0x02U)   /*!<data read mode*/
/**
  * @}
  */

/** @defgroup ESMC_AlternateBytesMode ESMC Alternate Bytes Mode
* @{
*/
#define ESMC_ALTERNATE_BYTES_DISABLE   0x00000000U                      /*!<No send alternate bytes*/
#define ESMC_ALTERNATE_BYTES_ENABLE    ((uint32_t)ESMC_SOCR_SENM)       /*!<Send alternate bytes right after ADDR*/
/**
  * @}
  */

/** @defgroup ESMC_SSxO ESMC CS Select
  * @{
  */
#define ESMC_SSxO_SS0            0x00000001U                      /*!<CS0 select*/
#define ESMC_SSxO_SS1            0x00000002U                      /*!<CS1 select*/
#define ESMC_SSxO_SS2            0x00000004U                      /*!<CS2 select*/
#define ESMC_SSxO_SS3            0x00000008U                      /*!<CS3 select*/
/**
  * @}
  */

/** @defgroup ESMC_DualFlash_Mode  ESMC Dual Flash Mode
* @{
*/
#define ESMC_DUALFLASH_ENABLE         ((uint32_t)ESMC_CR_2QSPI)
#define ESMC_DUALFLASH_DISABLE        ((uint32_t)0x00000000U)
/**
  * @}
  */

/** @defgroup ESMC_CS_PIN_SEL  ESMC CS pin select
* @{
*/
#define ESMC_SELECT_PIN_CS0         ((uint32_t)0x00000001U)      /*!<CS0 select*/
#define ESMC_SELECT_PIN_CS1         ((uint32_t)0x00000002U)      /*!<CS1 select*/
#define ESMC_SELECT_PIN_CS2         ((uint32_t)0x00000004U)      /*!<CS2 select*/
#define ESMC_SELECT_PIN_CS3         ((uint32_t)0x00000008U)      /*!<CS3 select*/
/**
  * @}
  */

/** @defgroup ESMC_DdrMode ESMC Ddr Mode
  * @{
  */
#define ESMC_DDR_DISABLE              ((uint32_t)0x00000000U)       /*!<Double data rate mode disabled*/
#define ESMC_DDR_DATA                 (ESMC_SOCR_DDRDATA)           /*!<Double data rate mode enabled*/
#define ESMC_DDR_ADDR_DATA            (ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRDATA)  /*!<Double data rate mode enabled*/
#define ESMC_DDR_CMD_ADDR_DATA        (ESMC_SOCR_DDRCMD  | ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRDATA)  /*!<Double data rate mode enabled*/
/**
  * @}
  */

/** @defgroup ESMC_Flags ESMC Flags
  * @{
  */
#define ESMC_FLAG_CMDIF                (ESMC_IFR_CMDIF << 8)        /*!<CMD flag: COMMAND Done*/
#define ESMC_FLAG_FIFOEIF              (ESMC_IFR_FIFOEIF << 8)      /*!<FIFO Empty flag: FIFO are completely empty*/
#define ESMC_FLAG_FIFOHIF              (ESMC_IFR_FIFOHIF << 8)      /*!<FIFO HALF Full flag: FIFO memory is half filled*/
#define ESMC_FLAG_FIFOFIF              (ESMC_IFR_FIFOFIF << 8)      /*!<FIFO Full flag: There is no free space in the FIFO Memory*/
#define ESMC_FLAG_IDLEIF               (ESMC_IFR_IDLEIF << 8)       /*!<IDLE flag: ESMC completed operation and went to IDLE state*/
#define ESMC_FLAG_DATAWAITIF           (ESMC_IFR_DATAWAITIF << 8)   /*!<DATA WAIT flag: In write operations FIFO is empty, or In read operations FIFO is full*/
#define ESMC_FLAG_FIFOOIF              (ESMC_IFR_FIFOOIF << 8)      /*!<FIFO Overflow flag: A data write occurred while Buffer was full, too many bytes loaded to the buffer*/
#define ESMC_FLAG_ADDRDONEIF           (ESMC_IFR_ADDRDONEIF << 8)   /*!<ADDRESS Done flag: the Address field has just been sent out*/
#define ESMC_FLAG_SSACTIVE             (ESMC_SR_SSACTIVE)           /*!<SS outputs Active flag: any of the SS outputs is active (low)*/
#define ESMC_FLAG_RXBUSY               (ESMC_SR_RXBUSY)             /*!<RX In progress flag: ESMC is busy with the data reception from Flash*/
#define ESMC_FLAG_TXBUSY               (ESMC_SR_TXBUSY)             /*!<TX In progress flag: ESMC is busy with memory write operations*/
#define ESMC_FLAG_IDLE                 (ESMC_SR_IDLE)               /*!<ESMC is in IDLE state*/
#define ESMC_FLAG_FIFIOOVERFOLOW       (ESMC_SR_FIFIOOVERFOLOW)     /*!<FIFO has operflown flag*/
#define ESMC_FLAG_IT                   (ESMC_SR_SPIF)               /*!<Interrupt request flag: There is at least one interrupt request pending*/
/**
  * @}
  */

/** @defgroup ESMC_Interrupts EMSC Interrupts
  * @{
  */
#define ESMC_IT_CMD                    ESMC_IER_CMDIE       /*!<Interrupt on the command done*/
#define ESMC_IT_FIFOE                  ESMC_IER_FIFOEIE     /*!<Interrupt on the fifo empty*/
#define ESMC_IT_FIFOH                  ESMC_IER_FIFOHIE     /*!<Interrupt on the fifo half full flag*/
#define ESMC_IT_FIFOF                  ESMC_IER_FIFOFIE     /*!<Interrupt on the fifo full flag*/
#define ESMC_IT_IDLE                   ESMC_IER_IDLEIE      /*!<Interrupt on the idle flag*/
#define ESMC_IT_DATAWAIT               ESMC_IER_DATAWAITIE  /*!<Interrupt on the data wait flag*/
#define ESMC_IT_FIFOO                  ESMC_IER_FIFOOIE     /*!<Interrupt on the fifo overflow flag*/
#define ESMC_IT_ADDRDONE               ESMC_IER_ADDRDONEIE  /*!<Interrupt on the address done flag*/

#define ESMC_IT_ALL                    (ESMC_IT_CMD  | ESMC_IT_FIFOE    | ESMC_IT_FIFOH | ESMC_IT_FIFOF | \
                                        ESMC_IT_IDLE | ESMC_IT_DATAWAIT | ESMC_IT_FIFOO | ESMC_IT_ADDRDONE)
/**
  * @}
  */

/** @defgroup ESMC_Timeout_definition ESMC Timeout definition
  * @{
  */
#define HAL_QPSI_TIMEOUT_DEFAULT_VALUE ((uint32_t)5000)/* 5 s */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup ESMC_Exported_Macros ESMC Exported Macros
  * @{
  */

