qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_hal_esmc.h
/** @brief Reset ESMC handle state
  * @param  __HANDLE__ ESMC handle.
  * @retval None
  */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
#define __HAL_ESMC_RESET_HANDLE_STATE(__HANDLE__)           do {                                              \
                                                                  (__HANDLE__)->State = HAL_ESMC_STATE_RESET; \
                                                                  (__HANDLE__)->MspInitCallback = NULL;       \
                                                                  (__HANDLE__)->MspDeInitCallback = NULL;     \
                                                               } while(0)
#else
#define __HAL_ESMC_RESET_HANDLE_STATE(__HANDLE__)           ((__HANDLE__)->State = HAL_ESMC_STATE_RESET)
#endif

/** @brief  Enable ESMC
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_ENABLE(__HANDLE__)                       SET_BIT((__HANDLE__)->Instance->CR, ESMC_CR_SPIEN)

/** @brief  Disable ESMC
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_DISABLE(__HANDLE__)                      CLEAR_BIT((__HANDLE__)->Instance->CR, ESMC_CR_SPIEN)

/** @brief  Enable ESMC Global interrupt
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_ENABLE_GLOBAL_IT(__HANDLE__)             SET_BIT((__HANDLE__)->Instance->CR, ESMC_CR_GIE)

/** @brief  Disable ESMC Global interrupt
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_DISABLE_GLOBAL_IT(__HANDLE__)            CLEAR_BIT((__HANDLE__)->Instance->CR, ESMC_CR_GIE)

/** @brief  Soft reset ESMC
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_SOFT_RESET(__HANDLE__)                   SET_BIT((__HANDLE__)->Instance->CR, ESMC_CR_SOFTRST)

/** @brief  Enables the specified ESMC interrupt.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __INTERRUPT__ specifies the ESMC interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg ESMC_IT_CMD     : ESMC Command Done interrupt
  *            @arg ESMC_IT_FIFOE   : ESMC FIFO empty interrupt
  *            @arg ESMC_IT_FIFOH   : ESMC FIFO half full interrupt
  *            @arg ESMC_IT_FIFOF   : ESMC FIFO full interrupt
  *            @arg ESMC_IT_IDLE    : ESMC Idle interrupt
  *            @arg ESMC_IT_DATAWAIT: ESMC Datawait interrupt
  *            @arg ESMC_IT_FIFOO   : ESMC FIFO OverFlow interrupt
  *            @arg ESMC_IT_ADDRDONE: ESMC Address Done interrupt
  * @retval None
  */
#define __HAL_ESMC_ENABLE_IT(__HANDLE__, __INTERRUPT__)     SET_BIT((__HANDLE__)->Instance->IER, (__INTERRUPT__))

/** @brief  Disables the specified ESMC interrupt.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __INTERRUPT__ specifies the ESMC interrupt source to disable.
  *          This parameter can be one of the following values:
  *            @arg ESMC_IT_CMD     : ESMC Command Done interrupt
  *            @arg ESMC_IT_FIFOE   : ESMC FIFO empty interrupt
  *            @arg ESMC_IT_FIFOH   : ESMC FIFO half full interrupt
  *            @arg ESMC_IT_FIFOF   : ESMC FIFO full interrupt
  *            @arg ESMC_IT_IDLE    : ESMC Idle interrupt
  *            @arg ESMC_IT_DATAWAIT: ESMC Datawait interrupt
  *            @arg ESMC_IT_FIFOO   : ESMC FIFO OverFlow interrupt
  *            @arg ESMC_IT_ADDRDONE: ESMC Address Done interrupt
  * @retval None
  */
#define __HAL_ESMC_DISABLE_IT(__HANDLE__, __INTERRUPT__)    CLEAR_BIT((__HANDLE__)->Instance->IER, (__INTERRUPT__))

/** @brief  Checks whether the specified ESMC interrupt source is enabled.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __INTERRUPT__ specifies the ESMC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg ESMC_IT_CMD     : ESMC Command Done interrupt
  *            @arg ESMC_IT_FIFOE   : ESMC FIFO empty interrupt
  *            @arg ESMC_IT_FIFOH   : ESMC FIFO half full interrupt
  *            @arg ESMC_IT_FIFOF   : ESMC FIFO full interrupt
  *            @arg ESMC_IT_IDLE    : ESMC Idle interrupt
  *            @arg ESMC_IT_DATAWAIT: ESMC Datawait interrupt
  *            @arg ESMC_IT_FIFOO   : ESMC FIFO OverFlow interrupt
  *            @arg ESMC_IT_ADDRDONE: ESMC Address Done interrupt
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#define __HAL_ESMC_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) (READ_BIT((__HANDLE__)->Instance->IER, (__INTERRUPT__)) == (__INTERRUPT__))

/**
  * @brief  Get the selected ESMC's flag status.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __FLAG__ specifies the ESMC flag to check.
  *          This parameter can be one of the following values:
  *            @arg ESMC_FLAG_CMDIF         : COMMAND Done flag
  *            @arg ESMC_FLAG_FIFOEIF       : FIFO Empty flag
  *            @arg ESMC_FLAG_FIFOHIF       : FIFO HALF Full flag
  *            @arg ESMC_FLAG_FIFOFIF       : FIFO Full flag
  *            @arg ESMC_FLAG_IDLEIF        : IDLE flag
  *            @arg ESMC_FLAG_DATAWAITIF    : DATA WAIT flag
  *            @arg ESMC_FLAG_FIFOOIF       : FIFO Overflow flag
  *            @arg ESMC_FLAG_ADDRDONEIF    : ADDRESS Done flag
  *            @arg ESMC_FLAG_SSACTIVE      : SS outputs Active flag
  *            @arg ESMC_FLAG_RXBUSY        : RX In progress flag
  *            @arg ESMC_FLAG_TXBUSY        : TX In progress flag
  *            @arg ESMC_FLAG_IDLE          : ESMC is in IDLE state
  *            @arg ESMC_FLAG_FIFIOOVERFOLOW: FIFO has operflown flag
  *            @arg ESMC_FLAG_IT            : Interrupt request flag:
  * @retval None
  */
#define __HAL_ESMC_GET_FLAG(__HANDLE__, __FLAG__)           (((*(__IO uint16_t *)(&(__HANDLE__)->Instance->SR) & (__FLAG__)) != 0) ? SET : RESET)

/** @brief  Clears the specified ESMC's flag status.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __FLAG__ specifies the ESMC clear register flag that needs to be set
  *          This parameter can be one of the following values:
  *            @arg ESMC_FLAG_CMDIF         : COMMAND Done flag
  *            @arg ESMC_FLAG_IDLEIF        : IDLE flag
  *            @arg ESMC_FLAG_ADDRDONEIF    : ADDRESS Done flag
  * @retval None
  */
#define __HAL_ESMC_CLEAR_FLAG(__HANDLE__, __FLAG__)         (*(__IO uint16_t *)(&(__HANDLE__)->Instance->SR) = (__FLAG__))

/** @brief  configure which slave select output should be driven during no xip mode.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __SSX__ specifies the CS pin
  *          The parameter can take the following values:
  *            @arg ESMC_SELECT_PIN_CS0
  *            @arg ESMC_SELECT_PIN_CS1
  *            @arg ESMC_SELECT_PIN_CS2
  *            @arg ESMC_SELECT_PIN_CS3
  * @retval None
  */
#define __HAL_ESMC_SET_SSXO(__HANDLE__, __SSX__)             SET_BIT((__HANDLE__)->Instance->ADDR32, (__SSX__)<<ESMC_ADDR32_SS_Pos)

/** @brief  configure which slave select output should be driven during xip mode.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __SSX__ specifies the CS pin
  *          The parameter can take the following values:
  *            @arg ESMC_SELECT_PIN_CS0
  *            @arg ESMC_SELECT_PIN_CS1
  *            @arg ESMC_SELECT_PIN_CS2
  *            @arg ESMC_SELECT_PIN_CS3
  * @retval None
  */
#define __HAL_ESMC_SET_XIP_SSXO(__HANDLE__, __SSX__)         SET_BIT((__HANDLE__)->Instance->ADDR32, (__SSX__)<<ESMC_ADDR32_XSS_Pos)

/** @brief  Clears the FIFO.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_CLEAR_FIFO(__HANDLE__)                    SET_BIT((__HANDLE__)->Instance->CR3, ESMC_CR3_FIFOCLR)

/** @brief  Enable the slave select.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_ENABLE_SLAVE(__HANDLE__)                  SET_BIT((__HANDLE__)->Instance->CR3, ESMC_CR3_SSSETRQ)

/** @brief  Disable the slave select.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_DISABLE_SLAVE(__HANDLE__)                 SET_BIT((__HANDLE__)->Instance->CR3, ESMC_CR3_SSCLRRQ)

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ESMC_Exported_Functions
  * @{
  */

/** @addtogroup ESMC_Exported_Functions_Group1
  * @{
  */
/* Initialization/de-initialization functions  ********************************/
HAL_StatusTypeDef     HAL_ESMC_Init     (ESMC_HandleTypeDef *hesmc);
HAL_StatusTypeDef     HAL_ESMC_DeInit   (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_MspInit  (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_MspDeInit(ESMC_HandleTypeDef *hesmc);
/**
  * @}
  */

/** @addtogroup ESMC_Exported_Functions_Group2
  * @{
  */
/* IO operation functions *****************************************************/
/* ESMC IRQ handler method */
void                  HAL_ESMC_IRQHandler(ESMC_HandleTypeDef *hesmc);

